Revit 2026 API

# IFCFileWriteOptions Properties

---

The IFCFileWriteOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FileFormat | The file format of the IFC file. |
|  | FileName | The full file name of the IFC file to be written. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

IFCFileWriteOptions Class

Autodesk.Revit.DB.IFC Namespace